Revit.Properties.Resources.AppearanceAssetElementPropertyPathInvalid
Looks up a localized string similar to Input value for imageProperty {0} is invalid. There is no {1} in {2}..

Revit.Properties.Resources.AppearanceAssetElementPropertyPathNoConnect
Looks up a localized string similar to Input value for imageProperty {0} is invalid. There is no texture connected to {1} in {2}..

Revit.Properties.Resources.CantCloseLastOpenView
Looks up a localized string similar to This is the last opened view {0} , can't be delete.

Revit.Properties.Resources.CantModifyInView
Looks up a localized string similar to Can't modify {0} of this view.

Revit.Properties.Resources.CeilingTypeNotFound
Looks up a localized string similar to A Revit CeilingType with that name could not be located in the document..

Revit.Properties.Resources.CreateProjectParameterForAllCategoriesObsolete
Looks up a localized string similar to This node may be removed in future version. Use CreateProjectParameterForAllCategories(string, string, SpecType, GroupType, bool) instead..

Revit.Properties.Resources.CreateProjectParameterObsolete
Looks up a localized string similar to This node may be removed in future version. Use CreateProjectParameter(string, string, SpecType, GroupType, bool, IEnumerable<Category>) instead..

Revit.Properties.Resources.CreateSharedParameterForAllCategoriesObsolete
Looks up a localized string similar to This node may be removed in future version. Use CreateSharedParameterForAllCategories(string, string, SpecType, GroupType, bool) instead..

Revit.Properties.Resources.CreateSharedParameterObsolete
Looks up a localized string similar to This node may be removed in future version. Use CreateSharedParameter(string, string, SpecType, GroupType, bool, IEnumerable<Category>) instead..

Revit.Properties.Resources.CurveReferenceHint
Looks up a localized string similar to The input curves should come from a Revit Element. You can use the {0} or {1} to turn this Curve into a Revit Element..

Revit.Properties.Resources.DuplicateViewCantApplySheet
Looks up a localized string similar to Please use Sheet.Duplicate node to Duplicate sheets.

Revit.Properties.Resources.ElementCantDelete
Looks up a localized string similar to This Element {0} {1} cannot be deleted.

Revit.Properties.Resources.EmptySchedule
Looks up a localized string similar to Cannot place empty schedule on sheet..

Revit.Properties.Resources.FaceReferenceHint
Looks up a localized string similar to The input surfaces should come from a Revit Element. You can use the {0} to turn this Surface into a Revit Element, then extract a ElementFaceReference from it..

Revit.Properties.Resources.FamilyDocumentAddParameterObsolete
Looks up a localized string similar to This node may be removed in future version. Use FamilyDocument.AddParameter(string, GroupType, SpecType, bool) instead..

Revit.Properties.Resources.GetTaggedLocalElements
Looks up a localized string similar to There are more than one Tagged Local Elements..

Revit.Properties.Resources.GetTaggedReferences
Looks up a localized string similar to There are more than one Tagged References..

Revit.Properties.Resources.GlobalParameterByNameObsolete
Looks up a localized string similar to This node may be removed in future version. Use GlobalParameter.ByName(string, SpecType).

Revit.Properties.Resources.GroupObsolete
Looks up a localized string similar to This property may be removed in future version. Use GroupType instead..

Revit.Properties.Resources.InputValueParameterValueTypeMismatch
Looks up a localized string similar to The value and the parameter values' data types are incompatible..

Revit.Properties.Resources.InvalidForgeTypeId
Looks up a localized string similar to The id string is not valid for object of type {0}..

Revit.Properties.Resources.NotEnoughDataError
Looks up a localized string similar to You need at least two {0} for a dimension..

Revit.Properties.Resources.NotHorizontalInputPolyCurveError
Looks up a localized string similar to Curves does not create closed horizontal loop..

Revit.Properties.Resources.ParameterTypeObsolete
Looks up a localized string similar to This property may be removed in future version. Use SpecType instead..

Revit.Properties.Resources.ReferenceSelectFailure
Looks up a localized string similar to Please select a surface or edge on an element..

Revit.Properties.Resources.Sheet_NoLocationSet
Looks up a localized string similar to Must supply more than 0 locations..

Revit.Properties.Resources.Sheet_ViewLocationMismatch
Looks up a localized string similar to View count should Equals location count..

Revit.Properties.Resources.SheetDuplicateNeedFix
Looks up a localized string similar to You must set a prefix or suffix to avoid duplicate sheet number.

Revit.Properties.Resources.SheetNumberExists
Looks up a localized string similar to The Sheet number {0} exists, please change your prefix or suffix.

Revit.Properties.Resources.ToposolidTypeNotFound
Looks up a localized string similar to There is no ToposolidType of the given name in the current Document..

Revit.Properties.Resources.UnitTypeObsolete
Looks up a localized string similar to This property may be removed in future version. Use SpecType instead..

Revit.Properties.Resources.ViewCantBeDuplicated
Looks up a localized string similar to This View {0} can't be duplicated.

Revit.Properties.Resources.ViewCantPackOnSheet
Looks up a localized string similar to View {0} could not be packed on the Sheet.  The sheet is {1} x {2} and the view to be added is {3} x {4}.

Revit.Properties.Resources.ViewDuplicateOptionOutofRange
Looks up a localized string similar to ViewDuplicateOption is invalid, please set input number should be 0, 1, 2.

Revit.Properties.Resources.ViewNameExists
Looks up a localized string similar to The View name {0} exists, please change your prefix or suffix.